<?php

return [
    // +----------------------------------------------------------------------
    // | 图片上传设置
    // +----------------------------------------------------------------------
    'imageUpLimit'                => [
        //大小
        'size'          =>  3145728 ,
        //类型
        'ext'=>'jpg,png,gif'
    ],

    // +----------------------------------------------------------------------
    // | 图片地址
    // +----------------------------------------------------------------------
    'img_url'    => 'http://admin.suiyiyou.net/image/',
    // +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------

    'cache'                  => [
        // 驱动方式
        'type'   => 'File',
        // 缓存保存目录
        'path'   => CACHE_PATH,
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],

    // +----------------------------------------------------------------------
    // | 会话设置
    // +----------------------------------------------------------------------
    'session'                => [
        'id'             => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // SESSION 前缀
        'prefix'         => 'home',
        // 驱动方式 支持redis memcache memcached
        'type'           => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,

        'domain'    => '.suiyiyou.net',
        'expire'        => 86400,
    ],

    // +----------------------------------------------------------------------
    // | Cookie设置
    // +----------------------------------------------------------------------
    'cookie'                 => [
        // cookie 名称前缀
        'prefix'    => '',
        // cookie 保存时间
        'expire'    => 86400,
        // cookie 保存路径
        'path'      => '/',
        // cookie 有效域名
        'domain'    => '.suiyiyou.net',
        //  cookie 启用安全传输
        'secure'    => false,
        // httponly设置
        'httponly'  => '',
        // 是否使用 setcookie
        'setcookie' => true,
    ],
];
