<?php

return [
    // +----------------------------------------------------------------------
    // | 图片上传设置
    // +----------------------------------------------------------------------
    'imageUpLimit'                => [
        //大小
        'size'          =>  3145728 ,
        //类型
        'ext'=>'jpg,png,gif'
    ],

    // +----------------------------------------------------------------------
    // | 图片地址
    // +----------------------------------------------------------------------
    'img_url' => 'http://www.kris1945.com/image/',

    // +----------------------------------------------------------------------
    // | 缓存设置
    // +----------------------------------------------------------------------

    'cache'                  => [
        // 驱动方式
        'type'   => 'File',
        // 缓存保存目录
        'path'   => CACHE_PATH,
        // 缓存前缀
        'prefix' => '',
        // 缓存有效期 0表示永久缓存
        'expire' => 0,
    ],

    'session'                => [
        'id'             => '',
        // SESSION_ID的提交变量,解决flash上传跨域
        'var_session_id' => '',
        // SESSION 前缀
        'prefix'         => 'think',
        // 驱动方式 支持redis memcache memcached
        'type'           => '',
        // 是否自动开启 SESSION
        'auto_start'     => true,
    ],
];
